package com.cyb.test.mytest.suanfa;

/**
 * 二分查找、归并、快排
 * 1:x ->
 * 2:x ->
 * 3:数组中重复的数字 -> 51
 * 4:二维数组中的查找 -> 100
 * 5:替换空格 -> 4
 * 6:从尾到头打印链表 -> 5
 * 7:重建二叉树 -> 6
 * 8:二叉树的下一个节点 -> 58
 * 9:两个栈实现一个队列 -> 7
 * 10:斐波那契数列第N项、青蛙跳台阶、大矩形放小矩形 -> 9
 * 11:旋转数组中的最小数字:二分查找 -> 8 ~
 * 12:矩阵中的路径：回溯法 -> 66
 * 13:机器人的运动范围：回溯 -> 67
 * 14:剪绳子：动态规划、贪婪算法 -> 102 ???  https://www.cnblogs.com/aiguozou/p/11576036.html
 * 15:二进制中1的个数 -> 10
 * 16:数值的整数次方:考虑指数为负数的情况，使用递归&位运算优化迭代相乘的过程 ->
 * 17:打印从1到最大的n位数：考虑大数的问题，用数组实现 ->
 * 18:删除链表中的节点 -> 57
 */
public class AAA {
}
